/*
    3. Слон и ладья 

    На шахматной доске расположены несколько черных слонов и ладей.
    Нужно определить, на сколько клеток доски можно поставить белую пешку, 
    чтобы она не находилась под боем черных фигур. 

    Входные данные: 
    На вход подается таблица 8 на 8, символ B (заглавная латинская буква) 
    означает, что в клетке стоит слон, символ R — ладья, 
    символ * — что клетка пуста. 

    Выходные данные: 
    Выведите количество клеток, на которую можно поставить белую пешку, 
    чтобы она не находилась под боем черных фигур.
*/